set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property CFGBVS VCCO [current_design]
set_property -dict {PACKAGE_PIN E3 IOSTANDARD LVCMOS33} [get_ports clk]
set_property -dict {PACKAGE_PIN D9 IOSTANDARD LVCMOS33} [get_ports rst]
set_property PACKAGE_PIN R13 [get_ports {light_D0[0]}]
set_property PACKAGE_PIN T10 [get_ports {light_D0[1]}]
set_property PACKAGE_PIN T9 [get_ports {light_D0[2]}]
set_property PACKAGE_PIN U13 [get_ports {light_D1[0]}]
set_property PACKAGE_PIN T13 [get_ports {light_D1[1]}]
set_property PACKAGE_PIN V14 [get_ports {light_D1[2]}]
set_property PACKAGE_PIN U14 [get_ports {light_D2[0]}]
set_property PACKAGE_PIN V11 [get_ports {light_D2[1]}]
set_property PACKAGE_PIN V10 [get_ports {light_D2[2]}]
set_property PACKAGE_PIN V12 [get_ports {light_D3[0]}]
set_property PACKAGE_PIN U12 [get_ports {light_D3[1]}]
set_property PACKAGE_PIN U11 [get_ports {light_D3[2]}]
set_property PACKAGE_PIN T11 [get_ports {light_D4[0]}]
set_property PACKAGE_PIN V17 [get_ports {light_D4[1]}]
set_property PACKAGE_PIN U16 [get_ports {light_D4[2]}]
set_property PACKAGE_PIN U18 [get_ports {light_D5[0]}]
set_property PACKAGE_PIN U17 [get_ports {light_D5[1]}]
set_property PACKAGE_PIN V16 [get_ports {light_D5[2]}]
set_property PACKAGE_PIN V15 [get_ports {light_D6[0]}]
set_property PACKAGE_PIN T16 [get_ports {light_D6[1]}]
set_property PACKAGE_PIN R16 [get_ports {light_D6[2]}]
set_property PACKAGE_PIN T15 [get_ports {light_D7[0]}]
set_property PACKAGE_PIN T14 [get_ports {light_D7[1]}]
set_property PACKAGE_PIN R15 [get_ports {light_D7[2]}]
set_property PACKAGE_PIN P15 [get_ports {light_D8[0]}]
set_property PACKAGE_PIN R17 [get_ports {light_D8[1]}]
set_property PACKAGE_PIN P17 [get_ports {light_D8[2]}]
set_property PACKAGE_PIN N16 [get_ports {light_D9[0]}]
set_property PACKAGE_PIN M17 [get_ports {light_D9[1]}]
set_property PACKAGE_PIN M16 [get_ports {light_D9[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D0[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D1[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D1[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D1[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D2[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D2[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D2[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D3[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D3[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D3[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D4[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D4[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D4[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D5[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D5[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D5[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D6[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D6[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D6[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D7[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D7[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D7[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D8[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D8[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D8[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D9[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D9[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {light_D9[2]}]


create_clock -period 100.000 -name clk -waveform {0.000 50.000} -add [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports rst]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D0[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D0[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D1[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D1[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D2[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D2[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D3[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D3[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D4[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D4[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D5[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D5[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D6[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D6[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D7[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D7[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D8[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D8[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.250 [get_ports {light_D9[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.500 [get_ports {light_D9[*]}]



